# дз на четверг
# 1. Меньшее из двух
# Пользователь вводит два целых числа. Выведите меньшее из них.

x = int(input("Введите первое число: "))
y = int(input("Введите второе число: "))

if x > y :
    print ("Меньшее число - " , y )
else:
    print ("Меньшее число - " , x )