# 7. Шахматный ĸонь ходит буĸвой "Г" - на две ĸлетĸи по вертиĸали в любом
# направлении и на одну ĸлетĸу по горизонтали, или наоборот. Даны две различные
# ĸлетĸи шахматной досĸи, определите, может ли ĸонь попасть с первой ĸлетĸи на
# вторую одним ходом. В случае, если хотя бы одно из введенных чисел не лежит в
# диапазоне от 1 до 8, выведите строĸу "Ошибĸа!".

x1 = int(input("Введите координату x первой клетки: "))
y1 = int(input("Введите координату y первой клетки: "))
x2 = int(input("Введите координату x второй клетки: "))
y2 = int(input("Введите координату y второй клетки: "))

if 1 <= x1 <= 8 and 1 <= x2 <= 8 and 1 <= y1 <= 8 and 1 <= y2 <= 8:
    if x2 == x1 + 2:
        if y2 == y1 + 1:
            print ("YES")
        elif y2 == y1 - 1:
            print ("YES")
    else:
        if y2 == y1 + 2:
            if x2 == x1 + 1:
                print ("YES")
            elif x2 == x1 - 1:
                print ("YES")
            else:
                print ("NO")
        else:
            print ("NO")

    if x2 == x1 - 2:
        if y2 == y1 + 1:
            print ("YES")
        elif y2 == y1 - 1:
            print ("YES")
    else:
        if y2 == y1 - 2:
            if x2 == x1 + 1:
                print("YES")
            elif x2 == x1 - 1:
                print("YES")
            else:
                print("NO")
        else:
            print("NO")

else:
    print("Ошибка!")

